comparedDBs/performance_test_scripts/Rocksdb_scripts/10B_RocksDB_OptanePM_Twitter_PreLoad_Performance/RocksDB_PreLoad_0.2B_val689_mem64MB_Cluster30_CT04_level1base512_targetbase64_Block16_Blkcache512_Tabcache5000.log
RocksDB:    version 9.4.0
Date:       Thu May 15 20:17:25 2025
CPU:        112 * Intel(R) Xeon(R) Gold 6348 CPU @ 2.60GHz
CPUCache:   43008 KB
num_: 200000000 entries_per_batch_:1
 The key size:22 value size:128 
The k_size:22 The v_size:689 
2025/05/15-20:25:40  ... thread 0: (100000000,100000000) ops and (201738.7,201738.7) ops/second in (495.690701,495.690701) seconds
rocksdb.block-cache-usage COUNT : 88
rocksdb.block-cache-pinned-usage COUNT : 88
rocksdb.estimate-table-readers-mem COUNT : 5364416

** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      3/0   44.36 MB   0.8      0.0     0.0      0.0      16.0     16.0       0.0   1.0      0.0    358.5     45.78             45.53      1107    0.041       0      0       0.0       0.0
  L1      8/0   505.30 MB   1.0    124.9    16.0    108.9     110.4      1.5       0.0   6.9    817.8    723.1    156.36            156.01       276    0.567    189M    21M       0.0       0.0
  L2     19/0   772.74 MB   0.2      0.8     0.4      0.4       0.5      0.2       0.6   1.2    950.0    636.2      0.88              0.88         5    0.175   1235K   407K       0.0       0.0
 Sum     30/0    1.29 GB   0.0    125.7    16.4    109.3     127.0     17.7       0.6   7.9    634.0    640.5    203.02            202.42      1388    0.146    190M    22M       0.0       0.0
 Int      0/0    0.00 KB   0.0    125.6    16.4    109.3     126.9     17.6       0.6   8.0    634.6    640.9    202.72            202.12      1382    0.147    190M    22M       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0    125.7    16.4    109.3     111.0      1.7       0.0   0.0    818.5    722.6    157.24            156.88       281    0.560    190M    22M       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      16.0     16.0       0.0   0.0      0.0    358.5     45.78             45.53      1107    0.041       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 495.7 total, 492.7 interval
Flush(GB): cumulative 16.025, interval 15.953
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 126.98 GB write, 262.31 MB/s write, 125.69 GB read, 259.65 MB/s read, 203.0 seconds
Interval compaction: 126.87 GB write, 263.69 MB/s write, 125.63 GB read, 261.11 MB/s read, 202.7 seconds
Estimated pending compaction bytes: 0
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 0, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 0, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 0, total-stops: 0
Block cache LRUCache@0x5c3c1d3a94e0#4034900 capacity: 8.00 MB seed: 637535790 usage: 0.09 KB table_size: 256 occupancy: 1 collections: 1 last_copies: 1 last_secs: 6.3e-05 secs_since: 495
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **
** Level 0 read latency histogram (micros):
Count: 9939 Average: 644.5735  StdDev: 305.10
Min: 24  Median: 704.5941  Max: 2671
Percentiles: P50: 704.59 P75: 817.52 P99: 1707.91 P99.9: 2623.92 P99.99: 2671.00
------------------------------------------------------
(      22,      34 ]      807   8.120%   8.120% ##
(      34,      51 ]      297   2.988%  11.108% #
(      51,      76 ]        2   0.020%  11.128% 
(      76,     110 ]        1   0.010%  11.138% 
(     170,     250 ]        1   0.010%  11.148% 
(     250,     380 ]       19   0.191%  11.339% 
(     380,     580 ]     1101  11.078%  22.417% ##
(     580,     870 ]     6381  64.202%  86.618% #############
(     870,    1300 ]     1096  11.027%  97.646% ##
(    1300,    1900 ]      198   1.992%  99.638% 
(    1900,    2900 ]       36   0.362% 100.000% 

** Level 1 read latency histogram (micros):
Count: 58795 Average: 593.1221  StdDev: 127.11
Min: 5  Median: 705.1985  Max: 2621
Percentiles: P50: 705.20 P75: 789.47 P99: 929.46 P99.9: 1751.51 P99.99: 2480.04
------------------------------------------------------
(       4,       6 ]        6   0.010%   0.010% 
(       6,      10 ]       27   0.046%   0.056% 
(      10,      15 ]       30   0.051%   0.107% 
(      15,      22 ]       16   0.027%   0.134% 
(      22,      34 ]       33   0.056%   0.190% 
(      34,      51 ]       97   0.165%   0.355% 
(      51,      76 ]      474   0.806%   1.162% 
(      76,     110 ]      651   1.107%   2.269% 
(     110,     170 ]      328   0.558%   2.827% 
(     170,     250 ]      604   1.027%   3.854% 
(     250,     380 ]      415   0.706%   4.560% 
(     380,     580 ]     4878   8.297%  12.857% ##
(     580,     870 ]    50585  86.036%  98.893% #################
(     870,    1300 ]      456   0.776%  99.668% 
(    1300,    1900 ]      181   0.308%  99.976% 
(    1900,    2900 ]       14   0.024% 100.000% 

** Level 2 read latency histogram (micros):
Count: 12 Average: 66.0833  StdDev: 28.58
Min: 29  Median: 63.5000  Max: 102
Percentiles: P50: 63.50 P75: 89.60 P99: 102.00 P99.9: 102.00 P99.99: 102.00
------------------------------------------------------
(      22,      34 ]        3  25.000%  25.000% #####
(      34,      51 ]        2  16.667%  41.667% ###
(      51,      76 ]        2  16.667%  58.333% ###
(      76,     110 ]        5  41.667% 100.000% ########


** DB Stats **
Uptime(secs): 495.7 total, 492.7 interval
Cumulative writes: 99M writes, 99M keys, 99M commit groups, 1.0 writes per commit group, ingest: 67.71 GB, 139.87 MB/s
Cumulative WAL: 99M writes, 0 syncs, 99999999.00 writes per sync, written: 67.71 GB, 139.87 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 99M writes, 99M keys, 99M commit groups, 1.0 writes per commit group, ingest: 68960.21 MB, 139.97 MB/s
Interval WAL: 99M writes, 0 syncs, 99463578.00 writes per sync, written: 67.34 GB, 139.97 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent
Write Stall (count): write-buffer-manager-limit-stops: 0
num-running-compactions: 0
num-running-flushes: 0

2025/05/15-20:33:58  ... thread 0: (100000000,200000000) ops and (201147.2,201442.5) ops/second in (497.148240,992.838941) seconds
rocksdb.block-cache-usage COUNT : 88
rocksdb.block-cache-pinned-usage COUNT : 88
rocksdb.estimate-table-readers-mem COUNT : 6884416

** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      3/0   43.74 MB   0.8      0.0     0.0      0.0      32.0     32.0       0.0   1.0      0.0    358.9     91.43             90.96      2215    0.041       0      0       0.0       0.0
  L1     26/0   473.21 MB   0.9    268.8    32.0    236.8     240.5      3.7       0.0   7.5    814.2    728.6    338.06            337.28       553    0.611    407M    42M       0.0       0.0
  L2     27/0    1.14 GB   0.2      5.7     2.7      3.0       3.6      0.6       0.6   1.3    973.5    609.6      6.02              6.01        42    0.143   8688K  3246K       0.0       0.0
 Sum     56/0    1.65 GB   0.0    274.5    34.7    239.8     276.2     36.3       0.6   8.6    645.5    649.3    435.51            434.24      2810    0.155    416M    46M       0.0       0.0
 Int      0/0    0.00 KB   0.0    116.9    14.4    102.6     117.2     14.6       0.0   9.4    656.2    657.5    182.47            181.94      1115    0.164    177M    18M       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0    274.5    34.7    239.8     244.1      4.3       0.0   0.0    817.0    726.5    344.08            343.29       595    0.578    416M    46M       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      32.0     32.0       0.0   0.0      0.0    358.9     91.43             90.96      2215    0.041       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 992.8 total, 389.8 interval
Flush(GB): cumulative 32.042, interval 12.511
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 276.17 GB write, 284.84 MB/s write, 274.52 GB read, 283.14 MB/s read, 435.5 seconds
Interval compaction: 117.17 GB write, 307.79 MB/s write, 116.93 GB read, 307.16 MB/s read, 182.5 seconds
Estimated pending compaction bytes: 0
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 0, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 0, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 0, total-stops: 0
Block cache LRUCache@0x5c3c1d3a94e0#4034900 capacity: 8.00 MB seed: 637535790 usage: 64.29 KB table_size: 256 occupancy: 5 collections: 2 last_copies: 0 last_secs: 7.6e-05 secs_since: 389
Block cache entry stats(count,size,portion): Misc(5,63.86 KB,0.779533%)

** File Read Latency Histogram By Level [default] **
** Level 0 read latency histogram (micros):
Count: 19911 Average: 644.0837  StdDev: 302.18
Min: 24  Median: 705.7582  Max: 2671
Percentiles: P50: 705.76 P75: 819.65 P99: 1696.82 P99.9: 2436.95 P99.99: 2671.00
------------------------------------------------------
(      22,      34 ]     1631   8.191%   8.191% ##
(      34,      51 ]      579   2.908%  11.099% #
(      51,      76 ]        3   0.015%  11.114% 
(      76,     110 ]        2   0.010%  11.125% 
(     170,     250 ]        1   0.005%  11.130% 
(     250,     380 ]       19   0.095%  11.225% 
(     380,     580 ]     2224  11.170%  22.395% ##
(     580,     870 ]    12675  63.658%  86.053% #############
(     870,    1300 ]     2273  11.416%  97.469% ##
(    1300,    1900 ]      461   2.315%  99.784% 
(    1900,    2900 ]       43   0.216% 100.000% 

** Level 1 read latency histogram (micros):
Count: 128582 Average: 594.3102  StdDev: 124.96
Min: 5  Median: 707.5738  Max: 2715
Percentiles: P50: 707.57 P75: 790.46 P99: 877.21 P99.9: 1724.47 P99.99: 2185.66
------------------------------------------------------
(       4,       6 ]       26   0.020%   0.020% 
(       6,      10 ]       94   0.073%   0.093% 
(      10,      15 ]       58   0.045%   0.138% 
(      15,      22 ]       72   0.056%   0.194% 
(      22,      34 ]       96   0.075%   0.269% 
(      34,      51 ]      130   0.101%   0.370% 
(      51,      76 ]     1012   0.787%   1.157% 
(      76,     110 ]     1485   1.155%   2.312% 
(     110,     170 ]      813   0.632%   2.944% 
(     170,     250 ]      968   0.753%   3.697% 
(     250,     380 ]      970   0.754%   4.452% 
(     380,     580 ]     9093   7.072%  11.523% #
(     580,     870 ]   112464  87.465%  98.988% #################
(     870,    1300 ]      905   0.704%  99.692% 
(    1300,    1900 ]      378   0.294%  99.986% 
(    1900,    2900 ]       18   0.014% 100.000% 

** Level 2 read latency histogram (micros):
Count: 1425 Average: 577.6119  StdDev: 176.56
Min: 6  Median: 707.5858  Max: 1315
Percentiles: P50: 707.59 P75: 791.99 P99: 1089.30 P99.9: 1315.00 P99.99: 1315.00
------------------------------------------------------
(       4,       6 ]        5   0.351%   0.351% 
(       6,      10 ]       10   0.702%   1.053% 
(      10,      15 ]        5   0.351%   1.404% 
(      15,      22 ]        6   0.421%   1.825% 
(      22,      34 ]        5   0.351%   2.175% 
(      34,      51 ]        6   0.421%   2.596% 
(      51,      76 ]       10   0.702%   3.298% 
(      76,     110 ]       43   3.018%   6.316% #
(     110,     170 ]        1   0.070%   6.386% 
(     170,     250 ]       37   2.596%   8.982% #
(     250,     380 ]        5   0.351%   9.333% 
(     380,     580 ]       41   2.877%  12.211% #
(     580,     870 ]     1224  85.895%  98.105% #################
(     870,    1300 ]       25   1.754%  99.860% 
(    1300,    1900 ]        2   0.140% 100.000% 


** DB Stats **
Uptime(secs): 992.8 total, 389.8 interval
Cumulative writes: 199M writes, 199M keys, 199M commit groups, 1.0 writes per commit group, ingest: 135.41 GB, 139.66 MB/s
Cumulative WAL: 199M writes, 0 syncs, 199999999.00 writes per sync, written: 135.41 GB, 139.66 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 78M writes, 78M keys, 78M commit groups, 1.0 writes per commit group, ingest: 54255.72 MB, 139.19 MB/s
Interval WAL: 78M writes, 0 syncs, 78254808.00 writes per sync, written: 52.98 GB, 139.19 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent
Write Stall (count): write-buffer-manager-limit-stops: 0
num-running-compactions: 0
num-running-flushes: 0

Total bytes written: 142200000000
Set seed to 1747311445149230 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       22 bytes each (+ 0 bytes user-defined timestamp)
Values:     128 bytes each (0 bytes after compression)
Entries:    200000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    28610.2 MB (estimated)
FileSize:   4196.2 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 5
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [/mnt/pmem1/rocks10B/PreLoad_Cluster30_0.2B_mem64MB_CT4_L1base512_targetbase64_Block16_Blkcache512_Tabcache5000]
the row_data[5] is:get
the row_data[5] is:get
the row_data[5] is:get
[...]
fillcluster  :       4.964 micros/op 201442 ops/sec 992.840 seconds 200000000 operations;  136.6 MB/s PERF_CONTEXT:
user_key_comparison_count = 5746001286, block_cache_hit_count = 0, block_read_count = 0, block_read_byte = 0, block_read_time = 0, block_read_cpu_time = 0, block_cache_index_hit_count = 0, block_cache_standalone_handle_count = 0, block_cache_real_handle_count = 0, index_block_read_count = 0, block_cache_filter_hit_count = 0, filter_block_read_count = 0, compression_dict_block_read_count = 0, block_cache_index_read_byte = 0, block_cache_filter_read_byte = 0, block_cache_compression_dict_read_byte = 0, block_cache_read_byte = 0, secondary_cache_hit_count = 0, compressed_sec_cache_insert_real_count = 0, compressed_sec_cache_insert_dummy_count = 0, compressed_sec_cache_uncompressed_bytes = 0, compressed_sec_cache_compressed_bytes = 0, block_checksum_time = 0, block_decompress_time = 0, get_read_bytes = 0, multiget_read_bytes = 0, iter_read_bytes = 0, blob_cache_hit_count = 0, blob_read_count = 0, blob_read_byte = 0, blob_read_time = 0, blob_checksum_time = 0, blob_decompress_time = 0, internal_key_skipped_count = 0, internal_delete_skipped_count = 0, internal_recent_skipped_count = 0, internal_merge_count = 0, internal_merge_point_lookup_count = 0, internal_range_del_reseek_count = 0, get_snapshot_time = 0, get_from_memtable_time = 0, get_from_memtable_count = 0, get_post_process_time = 0, get_from_output_files_time = 0, seek_on_memtable_time = 0, seek_on_memtable_count = 0, next_on_memtable_count = 0, prev_on_memtable_count = 0, seek_child_seek_time = 0, seek_child_seek_count = 0, seek_min_heap_time = 0, seek_max_heap_time = 0, seek_internal_seek_time = 0, find_next_user_entry_time = 0, write_wal_time = 435031663273, write_memtable_time = 257102750446, write_delay_time = 0, write_scheduling_flushes_compactions_time = 12693087698, write_pre_and_post_process_time = 50847007381, write_thread_wait_nanos = 0, db_mutex_lock_nanos = 0, db_condition_wait_nanos = 0, merge_operator_time_nanos = 0, read_index_block_nanos = 0, read_filter_block_nanos = 0, new_table_block_iter_nanos = 0, new_table_iterator_nanos = 0, block_seek_nanos = 0, find_table_nanos = 0, bloom_memtable_hit_count = 0, bloom_memtable_miss_count = 0, bloom_sst_hit_count = 0, bloom_sst_miss_count = 0, key_lock_wait_time = 0, key_lock_wait_count = 0, env_new_sequential_file_nanos = 0, env_new_random_access_file_nanos = 0, env_new_writable_file_nanos = 0, env_reuse_writable_file_nanos = 0, env_new_random_rw_file_nanos = 0, env_new_directory_nanos = 0, env_file_exists_nanos = 0, env_get_children_nanos = 0, env_get_children_file_attributes_nanos = 0, env_delete_file_nanos = 0, env_create_dir_nanos = 0, env_create_dir_if_missing_nanos = 0, env_delete_dir_nanos = 0, env_get_file_size_nanos = 0, env_get_file_modification_time_nanos = 0, env_rename_file_nanos = 0, env_link_file_nanos = 0, env_lock_file_nanos = 0, env_unlock_file_nanos = 0, env_new_logger_nanos = 0, get_cpu_nanos = 0, iter_next_cpu_nanos = 0, iter_prev_cpu_nanos = 0, iter_seek_cpu_nanos = 0, iter_next_count = 0, iter_prev_count = 0, iter_seek_count = 0, encrypt_data_nanos = 0, decrypt_data_nanos = 0, number_async_seek = 0, bloom_filter_useful = bloom_filter_full_positive = bloom_filter_full_true_positive = user_key_return_count = get_from_table_nanos = block_cache_hit_count = block_cache_miss_count =
Microseconds per write:
Count: 200000000 Average: 4.9642  StdDev: 2.80
Min: 3  Median: 4.3662  Max: 16380
Percentiles: P50: 4.37 P75: 5.40 P99: 9.67 P99.9: 12.57 P99.99: 159.31
------------------------------------------------------
(       2,       3 ]   877372   0.439%   0.439% 
(       3,       4 ] 81415004  40.708%  41.146% ########
(       4,       6 ] 96715492  48.358%  89.504% ##########
(       6,      10 ] 20688011  10.344%  99.848% ##
(      10,      15 ]   202461   0.101%  99.949% 
(      15,      22 ]    14994   0.007%  99.957% 
(      22,      34 ]    33233   0.017%  99.973% 
(      34,      51 ]    26872   0.013%  99.987% 
(      51,      76 ]     4341   0.002%  99.989% 
(      76,     110 ]     1030   0.001%  99.989% 
(     110,     170 ]     1448   0.001%  99.990% 
(     170,     250 ]    17873   0.009%  99.999% 
(     250,     380 ]     1744   0.001% 100.000% 
(     380,     580 ]       71   0.000% 100.000% 
(     580,     870 ]       18   0.000% 100.000% 
(     870,    1300 ]       15   0.000% 100.000% 
(    1300,    1900 ]       14   0.000% 100.000% 
(    1900,    2900 ]        3   0.000% 100.000% 
(    2900,    4400 ]        2   0.000% 100.000% 
(    4400,    6600 ]        1   0.000% 100.000% 
(   14000,   22000 ]        1   0.000% 100.000% 



** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      3/0   43.74 MB   0.8      0.0     0.0      0.0      32.0     32.0       0.0   1.0      0.0    358.9     91.43             90.96      2215    0.041       0      0       0.0       0.0
  L1     26/0   473.21 MB   0.9    268.8    32.0    236.8     240.5      3.7       0.0   7.5    814.2    728.6    338.06            337.28       553    0.611    407M    42M       0.0       0.0
  L2     27/0    1.14 GB   0.2      5.7     2.7      3.0       3.6      0.6       0.6   1.3    973.5    609.6      6.02              6.01        42    0.143   8688K  3246K       0.0       0.0
 Sum     56/0    1.65 GB   0.0    274.5    34.7    239.8     276.2     36.3       0.6   8.6    645.5    649.3    435.51            434.24      2810    0.155    416M    46M       0.0       0.0
 Int      0/0    0.00 KB   0.0    116.9    14.4    102.6     117.2     14.6       0.0   9.4    656.2    657.5    182.47            181.94      1115    0.164    177M    18M       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0    274.5    34.7    239.8     244.1      4.3       0.0   0.0    817.0    726.5    344.08            343.29       595    0.578    416M    46M       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      32.0     32.0       0.0   0.0      0.0    358.9     91.43             90.96      2215    0.041       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 992.8 total, 389.8 interval
Flush(GB): cumulative 32.042, interval 12.511
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 276.17 GB write, 284.83 MB/s write, 274.52 GB read, 283.14 MB/s read, 435.5 seconds
Interval compaction: 117.17 GB write, 307.79 MB/s write, 116.93 GB read, 307.16 MB/s read, 182.5 seconds
Estimated pending compaction bytes: 0
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 0, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 0, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 0, total-stops: 0
Block cache LRUCache@0x5c3c1d3a94e0#4034900 capacity: 8.00 MB seed: 637535790 usage: 64.29 KB table_size: 256 occupancy: 5 collections: 2 last_copies: 0 last_secs: 7.6e-05 secs_since: 389
Block cache entry stats(count,size,portion): Misc(5,63.86 KB,0.779533%)

** File Read Latency Histogram By Level [default] **
** Level 0 read latency histogram (micros):
Count: 19911 Average: 644.0837  StdDev: 302.18
Min: 24  Median: 705.7582  Max: 2671
Percentiles: P50: 705.76 P75: 819.65 P99: 1696.82 P99.9: 2436.95 P99.99: 2671.00
------------------------------------------------------
(      22,      34 ]     1631   8.191%   8.191% ##
(      34,      51 ]      579   2.908%  11.099% #
(      51,      76 ]        3   0.015%  11.114% 
(      76,     110 ]        2   0.010%  11.125% 
(     170,     250 ]        1   0.005%  11.130% 
(     250,     380 ]       19   0.095%  11.225% 
(     380,     580 ]     2224  11.170%  22.395% ##
(     580,     870 ]    12675  63.658%  86.053% #############
(     870,    1300 ]     2273  11.416%  97.469% ##
(    1300,    1900 ]      461   2.315%  99.784% 
(    1900,    2900 ]       43   0.216% 100.000% 

** Level 1 read latency histogram (micros):
Count: 128582 Average: 594.3102  StdDev: 124.96
Min: 5  Median: 707.5738  Max: 2715
Percentiles: P50: 707.57 P75: 790.46 P99: 877.21 P99.9: 1724.47 P99.99: 2185.66
------------------------------------------------------
(       4,       6 ]       26   0.020%   0.020% 
(       6,      10 ]       94   0.073%   0.093% 
(      10,      15 ]       58   0.045%   0.138% 
(      15,      22 ]       72   0.056%   0.194% 
(      22,      34 ]       96   0.075%   0.269% 
(      34,      51 ]      130   0.101%   0.370% 
(      51,      76 ]     1012   0.787%   1.157% 
(      76,     110 ]     1485   1.155%   2.312% 
(     110,     170 ]      813   0.632%   2.944% 
(     170,     250 ]      968   0.753%   3.697% 
(     250,     380 ]      970   0.754%   4.452% 
(     380,     580 ]     9093   7.072%  11.523% #
(     580,     870 ]   112464  87.465%  98.988% #################
(     870,    1300 ]      905   0.704%  99.692% 
(    1300,    1900 ]      378   0.294%  99.986% 
(    1900,    2900 ]       18   0.014% 100.000% 

** Level 2 read latency histogram (micros):
Count: 1425 Average: 577.6119  StdDev: 176.56
Min: 6  Median: 707.5858  Max: 1315
Percentiles: P50: 707.59 P75: 791.99 P99: 1089.30 P99.9: 1315.00 P99.99: 1315.00
------------------------------------------------------
(       4,       6 ]        5   0.351%   0.351% 
(       6,      10 ]       10   0.702%   1.053% 
(      10,      15 ]        5   0.351%   1.404% 
(      15,      22 ]        6   0.421%   1.825% 
(      22,      34 ]        5   0.351%   2.175% 
(      34,      51 ]        6   0.421%   2.596% 
(      51,      76 ]       10   0.702%   3.298% 
(      76,     110 ]       43   3.018%   6.316% #
(     110,     170 ]        1   0.070%   6.386% 
(     170,     250 ]       37   2.596%   8.982% #
(     250,     380 ]        5   0.351%   9.333% 
(     380,     580 ]       41   2.877%  12.211% #
(     580,     870 ]     1224  85.895%  98.105% #################
(     870,    1300 ]       25   1.754%  99.860% 
(    1300,    1900 ]        2   0.140% 100.000% 


** DB Stats **
Uptime(secs): 992.8 total, 0.0 interval
Cumulative writes: 200M writes, 200M keys, 200M commit groups, 1.0 writes per commit group, ingest: 135.41 GB, 139.66 MB/s
Cumulative WAL: 200M writes, 0 syncs, 200000000.00 writes per sync, written: 135.41 GB, 139.66 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 1 writes, 1 keys, 1 commit groups, 1.0 writes per commit group, ingest: 0.00 MB, 0.63 MB/s
Interval WAL: 1 writes, 0 syncs, 1.00 writes per sync, written: 0.00 GB, 0.63 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent
Write Stall (count): write-buffer-manager-limit-stops: 0

STATISTICS:
rocksdb.block.cache.miss COUNT : 18108563
rocksdb.block.cache.hit COUNT : 0
rocksdb.block.cache.add COUNT : 0
rocksdb.block.cache.add.failures COUNT : 0
rocksdb.block.cache.index.miss COUNT : 0
rocksdb.block.cache.index.hit COUNT : 0
rocksdb.block.cache.index.add COUNT : 0
rocksdb.block.cache.index.bytes.insert COUNT : 0
rocksdb.block.cache.filter.miss COUNT : 0
rocksdb.block.cache.filter.hit COUNT : 0
rocksdb.block.cache.filter.add COUNT : 0
rocksdb.block.cache.filter.bytes.insert COUNT : 0
rocksdb.block.cache.data.miss COUNT : 18108563
rocksdb.block.cache.data.hit COUNT : 0
rocksdb.block.cache.data.add COUNT : 0
rocksdb.block.cache.data.bytes.insert COUNT : 0
rocksdb.block.cache.bytes.read COUNT : 0
rocksdb.block.cache.bytes.write COUNT : 0
rocksdb.block.cache.compression.dict.miss COUNT : 0
rocksdb.block.cache.compression.dict.hit COUNT : 0
rocksdb.block.cache.compression.dict.add COUNT : 0
rocksdb.block.cache.compression.dict.bytes.insert COUNT : 0
rocksdb.block.cache.add.redundant COUNT : 0
rocksdb.block.cache.index.add.redundant COUNT : 0
rocksdb.block.cache.filter.add.redundant COUNT : 0
rocksdb.block.cache.data.add.redundant COUNT : 0
rocksdb.block.cache.compression.dict.add.redundant COUNT : 0
rocksdb.secondary.cache.hits COUNT : 0
rocksdb.secondary.cache.filter.hits COUNT : 0
rocksdb.secondary.cache.index.hits COUNT : 0
rocksdb.secondary.cache.data.hits COUNT : 0
rocksdb.compressed.secondary.cache.dummy.hits COUNT : 0
rocksdb.compressed.secondary.cache.hits COUNT : 0
rocksdb.compressed.secondary.cache.promotions COUNT : 0
rocksdb.compressed.secondary.cache.promotion.skips COUNT : 0
rocksdb.bloom.filter.useful COUNT : 0
rocksdb.bloom.filter.full.positive COUNT : 0
rocksdb.bloom.filter.full.true.positive COUNT : 0
rocksdb.bloom.filter.prefix.checked COUNT : 0
rocksdb.bloom.filter.prefix.useful COUNT : 0
rocksdb.bloom.filter.prefix.true.positive COUNT : 0
rocksdb.persistent.cache.hit COUNT : 0
rocksdb.persistent.cache.miss COUNT : 0
rocksdb.sim.block.cache.hit COUNT : 0
rocksdb.sim.block.cache.miss COUNT : 0
rocksdb.memtable.hit COUNT : 0
rocksdb.memtable.miss COUNT : 0
rocksdb.l0.hit COUNT : 0
rocksdb.l1.hit COUNT : 0
rocksdb.l2andup.hit COUNT : 0
rocksdb.compaction.key.drop.new COUNT : 46076372
rocksdb.compaction.key.drop.obsolete COUNT : 0
rocksdb.compaction.key.drop.range_del COUNT : 0
rocksdb.compaction.key.drop.user COUNT : 0
rocksdb.compaction.range_del.drop.obsolete COUNT : 0
rocksdb.compaction.optimized.del.drop.obsolete COUNT : 0
rocksdb.compaction.cancelled COUNT : 0
rocksdb.number.keys.written COUNT : 200000000
rocksdb.number.keys.read COUNT : 0
rocksdb.number.keys.updated COUNT : 0
rocksdb.bytes.written COUNT : 145400000000
rocksdb.bytes.read COUNT : 0
rocksdb.number.db.seek COUNT : 0
rocksdb.number.db.next COUNT : 0
rocksdb.number.db.prev COUNT : 0
rocksdb.number.db.seek.found COUNT : 0
rocksdb.number.db.next.found COUNT : 0
rocksdb.number.db.prev.found COUNT : 0
rocksdb.db.iter.bytes.read COUNT : 0
rocksdb.number.iter.skip COUNT : 0
rocksdb.number.reseeks.iteration COUNT : 0
rocksdb.num.iterator.created COUNT : 0
rocksdb.num.iterator.deleted COUNT : 0
rocksdb.no.file.opens COUNT : 6074
rocksdb.no.file.errors COUNT : 0
rocksdb.stall.micros COUNT : 0
rocksdb.db.mutex.wait.micros COUNT : 0
rocksdb.number.multiget.get COUNT : 0
rocksdb.number.multiget.keys.read COUNT : 0
rocksdb.number.multiget.bytes.read COUNT : 0
rocksdb.number.multiget.keys.found COUNT : 0
rocksdb.number.merge.failures COUNT : 0
rocksdb.getupdatessince.calls COUNT : 0
rocksdb.wal.synced COUNT : 0
rocksdb.wal.bytes COUNT : 145400000000
rocksdb.write.self COUNT : 200000000
rocksdb.write.other COUNT : 0
rocksdb.write.wal COUNT : 200000000
rocksdb.compact.read.bytes COUNT : 295720569019
rocksdb.compact.write.bytes COUNT : 262129512448
rocksdb.flush.write.bytes COUNT : 34405773823
rocksdb.compact.read.marked.bytes COUNT : 0
rocksdb.compact.read.periodic.bytes COUNT : 0
rocksdb.compact.read.ttl.bytes COUNT : 0
rocksdb.compact.write.marked.bytes COUNT : 0
rocksdb.compact.write.periodic.bytes COUNT : 0
rocksdb.compact.write.ttl.bytes COUNT : 0
rocksdb.number.direct.load.table.properties COUNT : 0
rocksdb.number.superversion_acquires COUNT : 2
rocksdb.number.superversion_releases COUNT : 0
rocksdb.number.superversion_cleanups COUNT : 0
rocksdb.number.block.compressed COUNT : 0
rocksdb.number.block.decompressed COUNT : 0
rocksdb.bytes.compressed.from COUNT : 0
rocksdb.bytes.compressed.to COUNT : 0
rocksdb.bytes.compression_bypassed COUNT : 295911592292
rocksdb.bytes.compression.rejected COUNT : 0
rocksdb.number.block_compression_bypassed COUNT : 18223210
rocksdb.number.block_compression_rejected COUNT : 0
rocksdb.bytes.decompressed.from COUNT : 0
rocksdb.bytes.decompressed.to COUNT : 0
rocksdb.merge.operation.time.nanos COUNT : 0
rocksdb.filter.operation.time.nanos COUNT : 0
rocksdb.compaction.total.time.cpu_micros COUNT : 343285688
rocksdb.row.cache.hit COUNT : 0
rocksdb.row.cache.miss COUNT : 0
rocksdb.read.amp.estimate.useful.bytes COUNT : 0
rocksdb.read.amp.total.read.bytes COUNT : 0
rocksdb.number.rate_limiter.drains COUNT : 0
rocksdb.blobdb.num.put COUNT : 0
rocksdb.blobdb.num.write COUNT : 0
rocksdb.blobdb.num.get COUNT : 0
rocksdb.blobdb.num.multiget COUNT : 0
rocksdb.blobdb.num.seek COUNT : 0
rocksdb.blobdb.num.next COUNT : 0
rocksdb.blobdb.num.prev COUNT : 0
rocksdb.blobdb.num.keys.written COUNT : 0
rocksdb.blobdb.num.keys.read COUNT : 0
rocksdb.blobdb.bytes.written COUNT : 0
rocksdb.blobdb.bytes.read COUNT : 0
rocksdb.blobdb.write.inlined COUNT : 0
rocksdb.blobdb.write.inlined.ttl COUNT : 0
rocksdb.blobdb.write.blob COUNT : 0
rocksdb.blobdb.write.blob.ttl COUNT : 0
rocksdb.blobdb.blob.file.bytes.written COUNT : 0
rocksdb.blobdb.blob.file.bytes.read COUNT : 0
rocksdb.blobdb.blob.file.synced COUNT : 0
rocksdb.blobdb.blob.index.expired.count COUNT : 0
rocksdb.blobdb.blob.index.expired.size COUNT : 0
rocksdb.blobdb.blob.index.evicted.count COUNT : 0
rocksdb.blobdb.blob.index.evicted.size COUNT : 0
rocksdb.blobdb.gc.num.files COUNT : 0
rocksdb.blobdb.gc.num.new.files COUNT : 0
rocksdb.blobdb.gc.failures COUNT : 0
rocksdb.blobdb.gc.num.keys.relocated COUNT : 0
rocksdb.blobdb.gc.bytes.relocated COUNT : 0
rocksdb.blobdb.fifo.num.files.evicted COUNT : 0
rocksdb.blobdb.fifo.num.keys.evicted COUNT : 0
rocksdb.blobdb.fifo.bytes.evicted COUNT : 0
rocksdb.blobdb.cache.miss COUNT : 0
rocksdb.blobdb.cache.hit COUNT : 0
rocksdb.blobdb.cache.add COUNT : 0
rocksdb.blobdb.cache.add.failures COUNT : 0
rocksdb.blobdb.cache.bytes.read COUNT : 0
rocksdb.blobdb.cache.bytes.write COUNT : 0
rocksdb.txn.overhead.mutex.prepare COUNT : 0
rocksdb.txn.overhead.mutex.old.commit.map COUNT : 0
rocksdb.txn.overhead.duplicate.key COUNT : 0
rocksdb.txn.overhead.mutex.snapshot COUNT : 0
rocksdb.txn.get.tryagain COUNT : 0
rocksdb.files.marked.trash COUNT : 0
rocksdb.files.marked.trash.deleted COUNT : 0
rocksdb.files.deleted.immediately COUNT : 8233
rocksdb.error.handler.bg.error.count COUNT : 0
rocksdb.error.handler.bg.io.error.count COUNT : 0
rocksdb.error.handler.bg.retryable.io.error.count COUNT : 0
rocksdb.error.handler.autoresume.count COUNT : 0
rocksdb.error.handler.autoresume.retry.total.count COUNT : 0
rocksdb.error.handler.autoresume.success.count COUNT : 0
rocksdb.memtable.payload.bytes.at.flush COUNT : 143765045096
rocksdb.memtable.garbage.bytes.at.flush COUNT : 108841178888
rocksdb.verify_checksum.read.bytes COUNT : 0
rocksdb.backup.read.bytes COUNT : 0
rocksdb.backup.write.bytes COUNT : 0
rocksdb.remote.compact.read.bytes COUNT : 0
rocksdb.remote.compact.write.bytes COUNT : 0
rocksdb.hot.file.read.bytes COUNT : 0
rocksdb.warm.file.read.bytes COUNT : 0
rocksdb.cold.file.read.bytes COUNT : 0
rocksdb.hot.file.read.count COUNT : 0
rocksdb.warm.file.read.count COUNT : 0
rocksdb.cold.file.read.count COUNT : 0
rocksdb.last.level.read.bytes COUNT : 0
rocksdb.last.level.read.count COUNT : 0
rocksdb.non.last.level.read.bytes COUNT : 295853570853
rocksdb.non.last.level.read.count COUNT : 149918
rocksdb.last.level.seek.filtered COUNT : 0
rocksdb.last.level.seek.filter.match COUNT : 0
rocksdb.last.level.seek.data COUNT : 0
rocksdb.last.level.seek.data.useful.no.filter COUNT : 0
rocksdb.last.level.seek.data.useful.filter.match COUNT : 0
rocksdb.non.last.level.seek.filtered COUNT : 0
rocksdb.non.last.level.seek.filter.match COUNT : 0
rocksdb.non.last.level.seek.data COUNT : 0
rocksdb.non.last.level.seek.data.useful.no.filter COUNT : 0
rocksdb.non.last.level.seek.data.useful.filter.match COUNT : 0
rocksdb.block.checksum.compute.count COUNT : 18126785
rocksdb.block.checksum.mismatch.count COUNT : 0
rocksdb.multiget.coroutine.count COUNT : 0
rocksdb.read.async.micros COUNT : 0
rocksdb.async.read.error.count COUNT : 0
rocksdb.table.open.prefetch.tail.miss COUNT : 0
rocksdb.table.open.prefetch.tail.hit COUNT : 30370
rocksdb.timestamp.filter.table.checked COUNT : 0
rocksdb.timestamp.filter.table.filtered COUNT : 0
rocksdb.readahead.trimmed COUNT : 0
rocksdb.fifo.max.size.compactions COUNT : 0
rocksdb.fifo.ttl.compactions COUNT : 0
rocksdb.prefetch.bytes COUNT : 0
rocksdb.prefetch.bytes.useful COUNT : 1137830602
rocksdb.prefetch.hits COUNT : 30370
rocksdb.footer.corruption.count COUNT : 0
rocksdb.db.get.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.db.write.micros P50 : 3.289549 P95 : 5.688165 P99 : 8.106293 P100 : 5295.000000 COUNT : 200000000 SUM : 797107377
rocksdb.compaction.times.micros P50 : 665686.936937 P95 : 771509.000000 P99 : 771509.000000 P100 : 771509.000000 COUNT : 595 SUM : 344083439
rocksdb.compaction.times.cpu_micros P50 : 665248.306998 P95 : 769601.000000 P99 : 769601.000000 P100 : 769601.000000 COUNT : 595 SUM : 343285688
rocksdb.subcompaction.setup.times.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.table.sync.micros P50 : 108.982394 P95 : 198.994083 P99 : 240.934911 P100 : 433.000000 COUNT : 2215 SUM : 248151
rocksdb.compaction.outfile.sync.micros P50 : 53.104592 P95 : 105.050611 P99 : 124.882609 P100 : 207.000000 COUNT : 3859 SUM : 212663
rocksdb.wal.file.sync.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.manifest.file.sync.micros P50 : 63.224011 P95 : 94.292466 P99 : 107.417397 P100 : 370.000000 COUNT : 2818 SUM : 175670
rocksdb.table.open.io.micros P50 : 128.194547 P95 : 238.410152 P99 : 330.955280 P100 : 364.000000 COUNT : 6074 SUM : 793587
rocksdb.db.multiget.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.read.block.compaction.micros P50 : 0.621101 P95 : 1.846345 P99 : 3.196254 P100 : 3167.000000 COUNT : 18108563 SUM : 111866012
rocksdb.read.block.get.micros P50 : 9.258065 P95 : 30.068502 P99 : 45.054704 P100 : 87.000000 COUNT : 12148 SUM : 146500
rocksdb.write.raw.block.micros P50 : 0.835373 P95 : 3.113417 P99 : 92.109718 P100 : 1695.000000 COUNT : 18241432 SUM : 61289972
rocksdb.numfiles.in.singlecompaction P50 : 10.249196 P95 : 14.582797 P99 : 14.968006 P100 : 22.000000 COUNT : 599 SUM : 6030
rocksdb.db.seek.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.db.write.stall P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.sst.read.micros P50 : 707.391800 P95 : 862.217967 P99 : 1219.829098 P100 : 2715.000000 COUNT : 149918 SUM : 90065044
rocksdb.file.read.flush.micros P50 : 30.148375 P95 : 47.895078 P99 : 50.496459 P100 : 83.000000 COUNT : 2215 SUM : 71586
rocksdb.file.read.compaction.micros P50 : 709.933485 P95 : 862.472136 P99 : 1222.802716 P100 : 2715.000000 COUNT : 147703 SUM : 89993458
rocksdb.file.read.db.open.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.get.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.multiget.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.db.iterator.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.verify.db.checksum.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.verify.file.checksums.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.sst.write.micros P50 : 0.518005 P95 : 0.984210 P99 : 3.354121 P100 : 1692.000000 COUNT : 36488938 SUM : 50952117
rocksdb.file.write.flush.micros P50 : 0.624583 P95 : 2.426534 P99 : 6.840585 P100 : 766.000000 COUNT : 4245799 SUM : 10101672
rocksdb.file.write.compaction.micros P50 : 0.506622 P95 : 0.962581 P99 : 1.979718 P100 : 1692.000000 COUNT : 32243139 SUM : 40850445
rocksdb.file.write.db.open.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.num.subcompactions.scheduled P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.bytes.per.read P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.bytes.per.write P50 : 727.000000 P95 : 727.000000 P99 : 727.000000 P100 : 727.000000 COUNT : 200000000 SUM : 145400000000
rocksdb.bytes.per.multiget P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.compression.times.nanos P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.decompression.times.nanos P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.read.num.merge_operands P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.key.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.value.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.write.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.get.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.multiget.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.seek.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.next.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.prev.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.blob.file.write.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.blob.file.read.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.blob.file.sync.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.compression.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.decompression.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.db.flush.micros P50 : 34296.610169 P95 : 71215.517241 P99 : 74270.689655 P100 : 93288.000000 COUNT : 2215 SUM : 91429988
rocksdb.sst.batch.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.multiget.io.batch.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.num.index.and.filter.blocks.read.per.level P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.num.sst.read.per.level P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.num.level.read.per.multiget P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.error.handler.autoresume.retry.count P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.async.read.bytes P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.poll.wait.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.prefetched.bytes.discarded P50 : 115767.758401 P95 : 370127.974617 P99 : 517952.000000 P100 : 517952.000000 COUNT : 12092 SUM : 1692481000
rocksdb.async.prefetch.abort.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.table.open.prefetch.tail.read.bytes P50 : 189644.970414 P95 : 457737.354086 P99 : 518656.000000 P100 : 518656.000000 COUNT : 6074 SUM : 1140913664